benchmark/4_TTL_PreCache/RENDER/GET/get_output_25conn_10s.txt
Running 10s test @ https://url-shortener-pbhq.onrender.com
  25 threads and 25 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   326.39ms  133.17ms   1.01s    85.48%
    Req/Sec     3.14      1.22     5.00     66.97%
  763 requests in 10.10s, 390.97KB read
Requests/sec:     75.55
Transfer/sec:     38.71KB